[Rainmeter]
Update=100



[Metadata]
Name=OmniCal
Author=⊰SK⊱
Version=v3.5
License=Creative Commons BY-NC-SA 3.0
Information=Настройка цвета темы календаря OmniCal (OmniCal Theme Color Settings)


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Подключение Variables                                     ~ (Variables inclusion)
    
    [Variables]
    @Include=#@#Variables.ini
    @Include1=#@#Variables_URL.ini

    ; Подключение файла темы (Theme file inclusion)
    ; Не менять вручную! (Do not change manually!)
        pathColorTheme=#@#Variables_Theme_#Theme#.ini
        @Include2=#pathColorTheme#

    @Include3=#@#Variables_ColorSettings.ini



;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; SettingsPanel StyleText

    [SettingsPanel_StyleText]
    FontColor=#OmniCal_Color_Setings_FontColor#
    FontSize=#CSP_FontSize#
    FontFace=#FontName#
    FontWeight=300
    AntiAlias=1

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Lua Скрипты (Lua Scripts)
    [OmniCal_Color_Settings_Script]
    Measure=Script
    ScriptFile=#CURRENTPATH#@Resources\OmniCal_Color_Settings.lua
    
    [ThemeReset_Script]
    Measure=Script
    ScriptFile=#CURRENTPATH#@Resources\ThemeReset.lua
    
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Подключение 'ColorSelector' к скину                       ~ (Connecting 'ColorSelector' to the skin)
    [ColorSelector_Start_Script]
    Measure=Script
    ScriptFile=#ROOTCONFIGPATH#\ColorSelector\@Resources\ColorSelector_Start.lua

    [ColorPath]
    Measure=String
    String=#pathColorTheme#
    UpdateDivider=-1
    OnUpdateAction=[!CommandMeasure "ColorSelector_Start_Script" "SetColorThemePath('#pathColorTheme#')"]

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Фон панели 'Настройка цвета'                              ~ (Color Settings Panel BG)
    [Measure_ColorSettingsPanelBG_RGBA] ; Взять ColorBg и заменить альфа канал на 255 ~ (Take ColorBg and replace alpha channel with 255)
    Measure=String
    String=[#SettingsPanelBG]
    RegExpSubstitute=1
    Substitute=",5$":"","^(\d+,\d+,\d+),.*$":"\1,255"
    DynamicVariables=1

    [ColorSettingsPanelBG] 
    Meter=Shape
    X=0
    Y=0
    Shape=Rectangle 0,0,#ColorSettingsPanel_W#,#ColorSettingsPanel_H#,5 | Fill Color [Measure_ColorSettingsPanelBG_RGBA] | StrokeWidth 1 | Stroke Color #SettingsPanelStrokeColor#


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Тема | КНОПКА Сброс темы | КНОПКА Встроенный цвет         ~ (Theme | Embedded Color Button)
    
    [Theme]  ; Текст Тема ~ (Theme Text)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    FontSize=(#CSP_FontSize#+1)
    FontWeight=600
    X=#PaddingL#
    Y=15
    Text=[#Str_Theme_[#Language]] 
    DynamicVariables=1

    [Theme_mode_Rectangle] 
    Meter=Shape
    X=([Theme:X]+[Theme:W]+5)
    Y=13
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineH1# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Theme FontColor "#ColorBGStrokeHover#"][!SetOption Tooltips_Text Text "[#Str_Theme_mode_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Theme FontColor "#OmniCal_Color_Setings_FontColor#"][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1


    [Theme_mode]  ; Текст вариант Темы ~ (Theme variant Text)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    FontSize=(#CSP_FontSize#+1)
    FontWeight=600
    X=([Theme:X]+[Theme:W]+10)
    Y=15
    Text=[#Str_Theme_mode_[#Language]] 
    DynamicVariables=1
    LeftMouseUpAction=[!CommandMeasure OmniCal_Color_Settings_Script "Toggle_Theme_FromColorSettings()"]



    [ThemeSettingsButton]
    Meter=Button
    ButtonImage=#@#Images\ThemeOtherSettings.png
    ; X=(#PaddingL#+#W_Cal_BG#+#Margin0#-10)
    X=(#PaddingL#+#W_Cal_BG#-23)
    Y=2
    DynamicVariables=1
    MouseOverAction=[!SetOption Tooltips_Text Text "[#Str_ThemeSettingsButton_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    LeftMouseUpAction=["#pathColorTheme#"]
    RightMouseDownAction=["#ROOTCONFIGPATH#"]




    [ResetThemeButton]  ; КНОПКА Сброс текущей темы к настройкам по умолчанию ~ (RESET THEME TO DEFAULT SETTINGS BUTTON)
    Meter=Button
    ButtonImage=#@#Images\btn_ResetTheme.png
    X=(#PaddingL#+#W_Cal_BG#+#Margin0#)
    Y=2
    DynamicVariables=1
    MouseOverAction=[!SetOption Tooltips_Text Text "[#Str_ResetThemeButton_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    LeftMouseUpAction=[!CommandMeasure ThemeReset_Script "ResetThemeToDefault()"]

    [CloseButton]  ; КНОПКА Встроенный цвет ~ (Close Button)
    Meter=Button
    ButtonImage=#@#Images\close.png
    X=(#ColorSettingsPanel_W#-40)
    Y=1
    DynamicVariables=1
    LeftMouseUpAction=[!DeactivateConfig]
    MouseOverAction=[!Redraw]
    MouseLeaveAction=[!Redraw]

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;▆▆▆[Блок-1] ~ [Block-1]▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Вычисление координат для Блока-1                          ~ (Calculating coordinates for Block-1)

    [EventFaded_Hidden]  ; Текст 'ПРОШЕДШЕЕ'-скрытый. Для получения ширины текста. ~ (Text 'PAST'-hidden. To get the width of the text.)
    Meter=String
    X=0
    Y=0
    Text=[#Str_EventFaded_[#Language]]
    Padding=5,0,5,0
    FontColor=0,0,0,0
    FontSize=10
    FontFace=Arial
    AntiAlias=1

    [MeasureEventFaded_W]
    Measure=Calc
    Formula=[EventFaded_Hidden:W]+#Margin0#
    OnUpdateAction=[!SetVariable W_Cal_FadedBG "[MeasureEventFaded_W]"]
    DynamicVariables=1

    [MeasureEvent_W]
    Measure=Calc
    Formula=(#ColorSettingsPanel_W#-#W_Cal_FadedBG#-(#PaddingL#*2)-#Margin0#)
    OnUpdateAction=[!SetVariable W_Cal_BG "[MeasureEvent_W]"]
    DynamicVariables=1


    [MeasureEventFaded_X]
    Measure=Calc
    Formula=(#PaddingL#+#W_Cal_BG#+#Margin0#)
    OnUpdateAction=[!SetVariable CalFadedBG_X "[MeasureEventFaded_X]"]
    DynamicVariables=1

    [MeasureEventFadedTxt_X]
    Measure=Calc
    Formula=(#CalFadedBG_X#+(#W_Cal_FadedBG#/2))
    OnUpdateAction=[!SetVariable EventFadedTxt_X "[MeasureEventFadedTxt_X]"]
    DynamicVariables=1



    [Calc_Cal_TextX]  ; Выч коорд 'Х' для ИМЯ КАЛЕНДАРЯ, СОБЫТИЕ, КНОПКА Встроенный цвет ~ (Calc coord 'X' for CALENDAR NAME, EVENT, BUTTON Embedded color)
    Measure=Calc
    Formula=(#PaddingL# + (#PaddingL#/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Cal_TextX "[Calc_Cal_TextX]"]
    UpdateDivider=-1

    [CalcEventButton_X]  ; Выч коорд 'Х' для ИМЯ КАЛЕНДАРЯ, СОБЫТИЕ, КНОПКА Встроенный цвет ~ (Calc coord 'X' for CALENDAR NAME, EVENT, BUTTON Embedded color)
    Measure=Calc
    Formula=(#PaddingL#+#W_Cal_BG#-[EventButton_1:W]-5)
    DynamicVariables=1
    OnUpdateAction=[!SetVariable EventButton_X "[CalcEventButton_X]"]
    UpdateDivider=-1

    [Calc_Event_X]  ; Выч коорд 'Х' для ИМЯ КАЛЕНДАРЯ, СОБЫТИЕ, КНОПКА Встроенный цвет ~ (Calc coord 'X' for CALENDAR NAME, EVENT, BUTTON Embedded color)  
    Measure=Calc
    Formula=(#PaddingL#+#W_Cal_BG#-[EventButton_1:W]-10)
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Event_X "[Calc_Event_X]"]
    UpdateDivider=-1

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 1      | Календарь 1                               ~ (Row 1 | Calendar 1)

    [CalFadedBG_1]  ; Фон ПРОШЕДШЕЕ ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=#PaddingT#
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_1_Bg_Faded# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_1_Bg_Faded', '[#Str_Cal_1_EventFaded_Tooltips_[#Language]]')"]
    RightMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_1_ColorTxtEventFaded', '[#Str_Cal_1_EventFaded_Tooltips_[#Language]]')"]
    MouseOverAction=[!SetOption CalFadedBG_1 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_1 FontWeight 600][!UpdateMeter EventFaded_1][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_1 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_1 FontWeight 300][!UpdateMeter EventFaded_1][!Redraw]
    DynamicVariables=1

    [CalcRow1_TextY]  ; Вычисл Row1_TextY координата центра текста для центрирования ~ (Calc Row1_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_1:Y] + ([CalFadedBG_1:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row1_TextY "[CalcRow1_TextY]"] 
    UpdateDivider=-1

    [EventFaded_1]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row1_TextY#
    Text=[#Str_EventFaded_[#Language]]
    FontColor=#Cal_1_ColorTxtEventFaded#
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_1 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_1_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_1 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1

    ; --------------------------

    [CalBG_1]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=#PaddingT#
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_1_Bg# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_1 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_1_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_1_Bg', '[#Str_Cal_1_Event_BG_[#Language]]')"]
    DynamicVariables=1

    [TxtCal_1]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row1_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar1_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0

    [Event_1]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row1_TextY#
    Text=[#Str_Event_[#Language]]
    FontColor=#Cal_1_ColorTxtEvent#
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!SetOption Event_1 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_1_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!SetOption Event_1 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_1_ColorTxtEvent', '[#Str_Cal_1_Event_Tooltips_[#Language]]')"]


    [EventButton_1]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_1#.png
    X=#EventButton_X#
    Y=(#Row1_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!SetOption TxtCal_1 ClipString 1][!SetOption Event_1 FontWeight 600][!SetOption Event_1 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_1][!UpdateMeter Event_1][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_1 FontSize #CSP_FontSize#][!SetOption TxtCal_1 ClipString 0][!SetOption Event_1 FontWeight 300][!SetOption Event_1 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_1][!UpdateMeter Event_1][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    LeftMouseUpAction=[!CommandMeasure OmniCal_Color_Settings_Script "Toggle_ApplyEmbeddedBGcolorCal_1()"]

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 2      | Календарь 2                               ~ (Row 2 | Calendar 2)

    [CalFadedBG_2]  ; Фон ПРОШЕДШЕЕ ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=([CalBG_1:Y]+[CalBG_1:H]+#BlockMargin#)
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_2_Bg_Faded# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_2_Bg_Faded', '[#Str_Cal_2_EventFaded_Tooltips_[#Language]]')"]
    RightMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_2_ColorTxtEventFaded', '[#Str_Cal_2_EventFaded_Tooltips_[#Language]]')"]
    MouseOverAction=[!SetOption CalFadedBG_2 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_2 FontWeight 600][!UpdateMeter EventFaded_2][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_2 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_2 FontWeight 300][!UpdateMeter EventFaded_2][!Redraw]
    DynamicVariables=1

    [CalcRow2_TextY]  ; Вычисл Row2_TextY координата центра текста для центрирования ~ (Calc Row2_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_2:Y] + ([CalFadedBG_2:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row2_TextY "[CalcRow2_TextY]"] 
    UpdateDivider=-1

    [EventFaded_2]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row2_TextY#
    ; Text=#Str_EventFaded#
    Text=[#Str_EventFaded_[#Language]]
    FontColor=#Cal_2_ColorTxtEventFaded#
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_2 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_2_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_2 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1



    [CalBG_2]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=([CalBG_1:Y]+[CalBG_1:H]+#BlockMargin#)
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_2_Bg# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_2 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_2_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_2_Bg', '[#Str_Cal_2_Event_BG_[#Language]]')"]
    DynamicVariables=1


    [TxtCal_2]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row2_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar2_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0

    [Event_2]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row2_TextY#
    Text=[#Str_Event_[#Language]]
    FontColor=#Cal_2_ColorTxtEvent#
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!SetOption Event_2 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_2_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!SetOption Event_2 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_2_ColorTxtEvent', '[#Str_Cal_2_Event_Tooltips_[#Language]]')"]


    [EventButton_2]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_2#.png
    X=#EventButton_X#
    Y=(#Row2_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!SetOption TxtCal_2 ClipString 1][!SetOption Event_2 FontWeight 600][!SetOption Event_2 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_2][!UpdateMeter Event_2][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_2 FontSize #CSP_FontSize#][!SetOption TxtCal_2 ClipString 0][!SetOption Event_2 FontWeight 300][!SetOption Event_2 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_2][!UpdateMeter Event_2][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    LeftMouseUpAction=[!CommandMeasure OmniCal_Color_Settings_Script "Toggle_ApplyEmbeddedBGcolorCal_2()"]

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 3      | Календарь 3                               ~ (Row 3 | Calendar 3)

    [CalFadedBG_3]  ; Фон ПРОШЕДШЕЕ  ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=([CalBG_2:Y]+[CalBG_2:H]+#BlockMargin#)
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_3_Bg_Faded# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_3_Bg_Faded', '[#Str_Cal_3_EventFaded_Tooltips_[#Language]]')"]
    RightMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_3_ColorTxtEventFaded', '[#Str_Cal_3_EventFaded_Tooltips_[#Language]]')"]
    MouseOverAction=[!SetOption CalFadedBG_3 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_3 FontWeight 600][!UpdateMeter EventFaded_3][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_3 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_3 FontWeight 300][!UpdateMeter EventFaded_3][!Redraw]
    DynamicVariables=1

    [CalcRow3_TextY]  ; Вычисл Row3_TextY координата центра текста для центрирования    ~ (Calc Row3_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_3:Y] + ([CalFadedBG_3:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row3_TextY "[CalcRow3_TextY]"] 
    UpdateDivider=-1

    [EventFaded_3]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row3_TextY#
    Text=[#Str_EventFaded_[#Language]]
    FontColor=#Cal_3_ColorTxtEventFaded#
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_3 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_3_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_3 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1



    [CalBG_3]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=([CalBG_2:Y]+[CalBG_2:H]+#BlockMargin#)
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_3_Bg# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_3 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_3_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_3_Bg', '[#Str_Cal_3_Event_BG_[#Language]]')"]
    DynamicVariables=1


    [TxtCal_3]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row3_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar3_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0

    [Event_3]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row3_TextY#
    Text=[#Str_Event_[#Language]]
    FontColor=#Cal_3_ColorTxtEvent#
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!SetOption Event_3 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_3_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!SetOption Event_3 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_3_ColorTxtEvent', '[#Str_Cal_3_Event_Tooltips_[#Language]]')"]


    [EventButton_3]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_3#.png
    X=#EventButton_X#
    Y=(#Row3_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!SetOption TxtCal_3 ClipString 1][!SetOption Event_3 FontWeight 600][!SetOption Event_3 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_3][!UpdateMeter Event_3][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_3 FontSize #CSP_FontSize#][!SetOption TxtCal_3 ClipString 0][!SetOption Event_3 FontWeight 300][!SetOption Event_3 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_3][!UpdateMeter Event_3][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    LeftMouseUpAction=[!CommandMeasure OmniCal_Color_Settings_Script "Toggle_ApplyEmbeddedBGcolorCal_3()"]

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 4      | Календарь 4                               ~ (Row 4 | Calendar 4)

    [CalFadedBG_4]  ; Фон ПРОШЕДШЕЕ ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=([CalBG_3:Y]+[CalBG_3:H]+#BlockMargin#)
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_4_Bg_Faded# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_4_Bg_Faded', '[#Str_Cal_4_EventFaded_Tooltips_[#Language]]')"]
    RightMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_4_ColorTxtEventFaded', '[#Str_Cal_4_EventFaded_Tooltips_[#Language]]')"]
    MouseOverAction=[!SetOption CalFadedBG_4 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_4 FontWeight 600][!UpdateMeter EventFaded_4][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_4 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_4 FontWeight 300][!UpdateMeter EventFaded_4][!Redraw]
    DynamicVariables=1

    [CalcRow4_TextY]  ; Вычисл Row4_TextY координата центра текста для центрирования    ~ (Calc Row4_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_4:Y] + ([CalFadedBG_4:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row4_TextY "[CalcRow4_TextY]"] 
    UpdateDivider=-1

    [EventFaded_4]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row4_TextY#
    Text=[#Str_EventFaded_[#Language]]
    FontColor=#Cal_4_ColorTxtEventFaded#
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_4 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_4_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_4 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1



    [CalBG_4]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=([CalBG_3:Y]+[CalBG_3:H]+#BlockMargin#)
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_4_Bg# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_4 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_4_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_4_Bg', '[#Str_Cal_4_Event_BG_[#Language]]')"]
    DynamicVariables=1


    [TxtCal_4]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row4_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar4_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0


    [Event_4]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row4_TextY#
    Text=[#Str_Event_[#Language]]
    FontColor=#Cal_4_ColorTxtEvent#
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!SetOption Event_4 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_4_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!SetOption Event_4 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_4_ColorTxtEvent', '[#Str_Cal_4_Event_Tooltips_[#Language]]')"]


    [EventButton_4]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_4#.png
    X=#EventButton_X#
    Y=(#Row4_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!SetOption TxtCal_4 ClipString 1][!SetOption Event_4 FontWeight 600][!SetOption Event_4 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_4][!UpdateMeter Event_4][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_4 FontSize #CSP_FontSize#][!SetOption TxtCal_4 ClipString 0][!SetOption Event_4 FontWeight 300][!SetOption Event_4 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_4][!UpdateMeter Event_4][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    LeftMouseUpAction=[!CommandMeasure OmniCal_Color_Settings_Script "Toggle_ApplyEmbeddedBGcolorCal_4()"]

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 5      | Календарь 5                               ~ (Row 5 | Calendar 5)

    [CalFadedBG_5]  ; Фон ПРОШЕДШЕЕ ~ (PAST BG)
    Meter=Shape
    X=#CalFadedBG_X#
    Y=([CalBG_4:Y]+[CalBG_4:H]+#BlockMargin#)
    W=0
    Shape=Rectangle 0,0,#W_Cal_FadedBG#, #RectangleH#, #BordrRad# | Fill Color #Cal_5_Bg_Faded# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_5_Bg_Faded', '[#Str_Cal_5_EventFaded_Tooltips_[#Language]]')"]
    RightMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_5_ColorTxtEventFaded', '[#Str_Cal_5_EventFaded_Tooltips_[#Language]]')"]
    MouseOverAction=[!SetOption CalFadedBG_5 StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption EventFaded_5 FontWeight 600][!UpdateMeter EventFaded_5][!Redraw]
    MouseLeaveAction=[!SetOption CalFadedBG_5 StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption EventFaded_5 FontWeight 300][!UpdateMeter EventFaded_5][!Redraw]
    DynamicVariables=1


    [CalcRow5_TextY]  ; Вычисл Row5_TextY координата центра текста для центрирования ~ (Calc Row5_TextY center coord for centering text)
    Measure=Calc
    Formula=([CalFadedBG_5:Y] + ([CalFadedBG_5:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row5_TextY "[CalcRow5_TextY]"] 
    UpdateDivider=-1

    [EventFaded_5]  ; Текст ПРОШЕДШЕЕ ~ (Text PAST)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#EventFadedTxt_X#
    Y=#Row5_TextY#
    FontColor=#Cal_5_ColorTxtEventFaded#
    Text=[#Str_EventFaded_[#Language]]
    StringAlign=CenterCenter
    Padding=5,0,5,0
    MouseOverAction=[!SetOption EventFaded_5 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_5_EventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption EventFaded_5 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1



    [CalBG_5]  ; Фон СОБЫТИЕ ~ (BG EVENT)
    Meter=Shape
    X=#PaddingL#
    Y=([CalBG_4:Y]+[CalBG_4:H]+#BlockMargin#)
    Shape=Rectangle 0,0,#W_Cal_BG#,#RectangleH#,#BordrRad# | Fill Color #Cal_5_Bg# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption TxtCal_5 FontSize (#CSP_FontSize#+1)][!SetOption Tooltips_Text Text "[#Str_Cal_5_Event_BG_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_5_Bg', '[#Str_Cal_5_Event_BG_[#Language]]')"]
    DynamicVariables=1


    [TxtCal_5]  ; Текст ИМЯ КАЛЕНДАРЯ ~ (Text CALENDAR NAME)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Cal_TextX#
    Y=#Row5_TextY#
    W=(#ColorSettingsPanel_W#/#TxtCal_W_Coef#)
    Text=#iCalendar5_name#
    FontWeight=600
    DynamicVariables=1
    StringAlign=LeftCenter
    ClipString=0


    [Event_5]  ; Текст СОБЫТИЕ ~ (Text EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Event_X#
    Y=#Row5_TextY#
    Text=[#Str_Event_[#Language]]
    FontColor=#Cal_5_ColorTxtEvent#
    StringAlign=RightCenter
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!SetOption Event_5 FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Cal_5_Event_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!SetOption Event_5 FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('Cal_5_ColorTxtEvent', '[#Str_Cal_5_Event_Tooltips_[#Language]]')"]


    [EventButton_5]  ; КНОПКА Встроенный цвет ~ (BUTTON Embedded color)
    Meter=Button
    ButtonImage=#@#Images\switch_#applyEmbeddedBGcolorCal_5#.png
    X=#EventButton_X#
    Y=(#Row5_TextY#-9)
    DynamicVariables=1
    MouseOverAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!SetOption TxtCal_5 ClipString 1][!SetOption Event_5 FontWeight 600][!SetOption Event_5 Text "[#Str_Embedded_[#Language]]"][!UpdateMeter TxtCal_5][!UpdateMeter Event_5][!SetOption Tooltips_Text Text "[#Str_Embedded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption TxtCal_5 FontSize #CSP_FontSize#][!SetOption TxtCal_5 ClipString 0][!SetOption Event_5 FontWeight 300][!SetOption Event_5 Text "[#Str_Event_[#Language]]"][!UpdateMeter TxtCal_5][!UpdateMeter Event_5][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    LeftMouseUpAction=[!CommandMeasure OmniCal_Color_Settings_Script "Toggle_ApplyEmbeddedBGcolorCal_5()"]

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 5А      | FontSizeEvent_Text                       ~ (Row 5A | FontSizeEvent_Text )
    
    [FontSizeEvent_Text]  ; Текст Размер шрифта текста для СОБЫТИЕ ~ (Text Font size for EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=([CalBG_5:Y]+[CalBG_5:H]+(#BlockMargin#*1)+10)
    Text=[#Str_Cal_1_FontSizeEvent_Tooltips_[#Language]]
    Padding=5,0,5,0
    DynamicVariables=1

    ; --------------------------

    [FontSizeEvent_Input_Rect] ; Поле ввода размера шрифта события ~ (Event font size input field)
    Meter=Shape
    X=(#Col2_X#+#Rectangle1_W#-32)
    Y=([FontSizeEvent_Text:Y]-4)
    Shape=Rectangle 0,0,32,18,3 | Fill Color #SettingsPanelBG# | StrokeWidth 1 | Stroke Color #ColorBGStroke#
    LeftMouseUpAction=[!CommandMeasure FontSizeEvent_Input "ExecuteBatch 1"]
    MouseOverAction=[!SetOption FontSizeEvent_Text FontWeight 600][!SetOption FontSizeEvent_Input_Rect Shape "Rectangle 0,0,32,18,3 | Fill Color #ColorBg# | StrokeWidth 1 | Stroke Color #ColorBGStrokeHover#"][!SetOption Tooltips_Text Text "[#Str_FontSizeEvent_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption FontSizeEvent_Text FontWeight 300][!SetOption FontSizeEvent_Input_Rect Shape "Rectangle 0,0,32,18,3 | Fill Color #ColorBg# | StrokeWidth 1 | Stroke Color #ColorBGStroke#"][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1
    Group=SettingsPanel

    [FontSizeEvent_Input_Label]
    Meter=String
    X=([FontSizeEvent_Input_Rect:X]+([FontSizeEvent_Input_Rect:W]/2)-1)
    Y=([FontSizeEvent_Input_Rect:Y]+9)
    FontSize=9
    FontColor=#SettingsPanelTxtFontColor#
    FontFace=#FontName#
    StringAlign=CenterCenter
    Text=#FontSizeEvent#
    AntiAlias=1
    Group=SettingsPanel
    DynamicVariables=1

    [FontSizeEvent_Input]
    Measure=Plugin
    Plugin=InputText
    InputNumber=1
    SolidColor=#SettingsPanelBG#
    FontColor=#SettingsPanelTxtFontColor#
    FontFace=#FontName#
    FontSize=9
    StringStyle=Bold
    StringAlign=Center
    X=([FontSizeEvent_Input_Rect:X]+2)
    Y=([FontSizeEvent_Input_Rect:Y]+0)
    W=([FontSizeEvent_Input_Rect:W]-4)
    H=([FontSizeEvent_Input_Rect:H]-4)
    DefaultValue="#FontSizeEvent#"
    Command1=[!SetVariable TempInputFontSize "$UserInput$"][!CommandMeasure OmniCal_Color_Settings_Script "HandleInputFontSizeEvent()"]
    FocusDismiss=1
    DynamicVariables=1
    UpdateDivider=-1
    Group=SettingsPanel



    ; --------------------------------------------------------------------------------------------------------
    [FontSizeEventFaded_Text]  ; Текст Размер шрифта текста для СОБЫТИЕ ~ (Text Font size for EVENT)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=([CalBG_5:Y]+[CalBG_5:H]+(#BlockMargin#*1)+10)
    Text=[#Str_Cal_1_FontSizeEventFaded_Tooltips_[#Language]]
    ; Padding=5,0,5,0
    DynamicVariables=1

    ; --------------------------

    [FontSizeEventFaded_Input_Rect] ; Поле ввода размера шрифта события ~ (Event font size input field)
    Meter=Shape
    X=(#Col4_X#+#Rectangle1_W#-32)
    Y=([FontSizeEventFaded_Text:Y]-4)
    Shape=Rectangle 0,0,32,18,3 | Fill Color #SettingsPanelBG# | StrokeWidth 1 | Stroke Color #ColorBGStroke#
    LeftMouseUpAction=[!CommandMeasure FontSizeEventFaded_Input "ExecuteBatch 1"]
    MouseOverAction=[!SetOption FontSizeEventFaded_Text FontWeight 600][!SetOption FontSizeEventFaded_Input_Rect Shape "Rectangle 0,0,32,18,3 | Fill Color #ColorBg# | StrokeWidth 1 | Stroke Color #ColorBGStrokeHover#"][!SetOption Tooltips_Text Text "[#Str_FontSizeEventFaded_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption FontSizeEventFaded_Text FontWeight 300][!SetOption FontSizeEventFaded_Input_Rect Shape "Rectangle 0,0,32,18,3 | Fill Color #ColorBg# | StrokeWidth 1 | Stroke Color #ColorBGStroke#"][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    DynamicVariables=1
    Group=SettingsPanel

    [FontSizeEventFaded_Input_Label]
    Meter=String
    X=([FontSizeEventFaded_Input_Rect:X]+([FontSizeEventFaded_Input_Rect:W]/2)-1)
    Y=([FontSizeEventFaded_Input_Rect:Y]+9)
    FontSize=9
    FontColor=#SettingsPanelTxtFontColor#
    FontFace=#FontName#
    StringAlign=CenterCenter
    Text=#FontSizeEvent_Faded#
    AntiAlias=1
    Group=SettingsPanel
    DynamicVariables=1

    [FontSizeEventFaded_Input]
    Measure=Plugin
    Plugin=InputText
    InputNumber=1
    SolidColor=#SettingsPanelBG#
    FontColor=#SettingsPanelTxtFontColor#
    FontFace=#FontName#
    FontSize=9
    StringStyle=Bold
    StringAlign=Center
    X=([FontSizeEventFaded_Input_Rect:X]+2)
    Y=([FontSizeEventFaded_Input_Rect:Y]+0)
    W=([FontSizeEventFaded_Input_Rect:W]-4)
    H=([FontSizeEventFaded_Input_Rect:H]-4)
    DefaultValue="#FontSizeEvent_Faded#"
    Command1=[!SetVariable TempInputFontSizeFaded "$UserInput$"][!CommandMeasure OmniCal_Color_Settings_Script "HandleInputFontSizeEvent_Faded()"]
    FocusDismiss=1
    DynamicVariables=1
    UpdateDivider=-1
    Group=SettingsPanel

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 5А_1    | Разделительная линия                     ~ (Row 5А_1 | Divider line)   

    [Row_5A_1]  
    Meter=Shape
    X=#PaddingL#
    Y=([FontSizeEvent_Text:Y]+[FontSizeEvent_Text:H]+(#BlockMargin#*2.5))
    ; Y=200
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),2,0 | Fill Color #ColorLineH1# | StrokeWidth 0 | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=0
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;▆▆▆[Блок-2] ~ [Block-2]▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Вычисления координат колонок                              ~ (Calculations of column coordinates)

    [Calc_Col2_X]  ; Вычисл Col2_X ~ (Calc Col2_X)
    Measure=Calc
    Formula=((#ColorSettingsPanel_W#/2)-#PaddingL#-(#ColorSettingsPanel_W#/7)-5)
    ; Formula=150
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Col2_X "[Calc_Col2_X]"] 
    UpdateDivider=-1

    [Calc_Col3_X]  ; Вычисл Col3_X ~ (Calc Col3_X)
    Measure=Calc
    Formula=((#ColorSettingsPanel_W#/2)+5)
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Col3_X "[Calc_Col3_X]"] 
    UpdateDivider=-1

    [Calc_Col4_X]  ; Вычисл Col4_X  ~ (Calc Col4_X)
    Measure=Calc
    Formula=(#ColorSettingsPanel_W#-#PaddingL#-((#ColorSettingsPanel_W#/7)))
    ; Formula=350
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Col4_X "[Calc_Col4_X]"] 
    UpdateDivider=-1

    [Calc_Rectangle1_W]  ; Вычисл ширину Rectangle1 ~ (Calc Rectangle1 width)
    Measure=Calc
    Formula=(#ColorSettingsPanel_W#/7)
    ; Formula=350
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Rectangle1_W "[Calc_Rectangle1_W]"] 
    UpdateDivider=-1

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 6      | Линия часа         | Линия получаса       ~ (Row 6 | Hour line    | Half-hour line)

    [CalcRow6_TextY]  ; Вычисл Row6_TextY координата центра текста для центрирования
    Measure=Calc
    Formula=([Row_6_Col_2_Rectangle:Y] + ([Row_6_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row6_TextY "[CalcRow6_TextY]"] 
    UpdateDivider=-1

    [Row_6_Col_1_Text]  ;Линия часа  ~ (Hour line)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row6_TextY#
    Text=[#Str_HourLine_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1


    [Row_6_Col_2_Rectangle] 
    Meter=Shape
    X=#Col2_X#
    Y=([FontSizeEvent_Text:Y]+[FontSizeEvent_Text:H]+(#BlockMargin#*3)+10)
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineH1# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_6_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_6_Col_1_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_HourLine_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_6_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_6_Col_1_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorLineH1', '[#Str_HourLine_Tooltips_[#Language]]')"]
    DynamicVariables=1


    [Row_6_Col_3_Text]  ;Линия получаса ~ (Half-hour line)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row6_TextY#
    Text=[#Str_HalfHourLine_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1


    [Row_6_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([FontSizeEvent_Text:Y]+[FontSizeEvent_Text:H]+(#BlockMargin#*3)+10)
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineH2# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_6_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_6_Col_3_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_HalfHourLine_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_6_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_6_Col_3_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorLineH2', '[#Str_HalfHourLine_Tooltips_[#Language]]')"]
    DynamicVariables=1


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 7      | Линия заголовка    | Вертикальные линии   ~ (Row 7 | Header line  | Vertical Lines)

    [CalcRow7_TextY]  ; Вычисл Row7_TextY координата центра текста для центрирования ~ (Calc Row7_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_7_Col_2_Rectangle:Y] + ([Row_7_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row7_TextY "[CalcRow7_TextY]"] 
    UpdateDivider=-1

    [Row_7_Col_1_Text]  ;Заголовок ~ (Header)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row7_TextY#
    Text=[#Str_HeaderLine_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1


    [Row_7_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_6_Col_2_Rectangle:Y]+[Row_6_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineH0# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_7_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_7_Col_1_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_HeaderLine_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_7_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_7_Col_1_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorLineH0', '[#Str_HeaderLine_Tooltips_[#Language]]')"]
    DynamicVariables=1


    [Row_7_Col_3_Text]  ;Выходные ~ (Weekends)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row7_TextY#
    Text=[#Str_VerticalLines_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1


    [Row_7_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_6_Col_2_Rectangle:Y]+[Row_6_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorLineVertH1# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_7_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_7_Col_3_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_VerticalLines_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_7_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_7_Col_3_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorLineVertH1', '[#Str_VerticalLines_Tooltips_[#Language]]')"]
    DynamicVariables=1


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 7_1    | Разделительная линия                      ~ (Row 7_1 | Divider line)   

    [Row_7_1]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_7_Col_2_Rectangle:Y]+[Row_7_Col_2_Rectangle:H]+(#BlockMargin#*2))
    ; Y=200
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),1,0 | Fill Color #ColorLineH1# | StrokeWidth 0 | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=0

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 8*     | Заголовок          | Выходные             ~ (Row 8 | Header       | Weekends)

    [CalcRow8_TextY]  ; Вычисл Row7_TextY координата центра текста для центрирования ~ (Calc Row7_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_8_Col_2_Rectangle:Y] + ([Row_8_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row8_TextY "[CalcRow8_TextY]"] 
    UpdateDivider=-1

    [Row_8_Col_1_Text]  ;Заголовок ~ (Header)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row8_TextY#
    Text=[#Str_Header_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1


    [Row_8_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_7_Col_2_Rectangle:Y]+[Row_7_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTxtH1# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_8_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_8_Col_1_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Header_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_8_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_8_Col_1_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtH1', '[#Str_Header_Tooltips_[#Language]]')"]
    DynamicVariables=1


    [Row_8_Col_3_Text]  ;Выходные ~ (Weekends)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row8_TextY#
    Text=[#Str_HeaderWeekend_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1


    [Row_8_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_7_Col_2_Rectangle:Y]+[Row_7_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTxtH1_Weekend# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_8_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_8_Col_3_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_HeaderWeekend_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_8_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_8_Col_3_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTxtH1_Weekend', '[#Str_HeaderWeekend_Tooltips_[#Language]]')"]
    DynamicVariables=1


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 9      | Время              | Текущ время          ~ (Row 9 | Time         | CurrentTime)

    [CalcRow9_TextY]  ; Вычисл Row8_TextY координата центра текста для центрирования ~ (Calc Row8_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_9_Col_2_Rectangle:Y] + ([Row_9_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row9_TextY "[CalcRow9_TextY]"] 
    UpdateDivider=-1

    [Row_9_Col_1_Text]  ;Время ~ (Time)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row9_TextY#
    Text=[#Str_TimeLabels_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1


    [Row_9_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_8_Col_2_Rectangle:Y]+[Row_8_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTtmeTxt# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_9_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_9_Col_1_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_TimeLabels_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_9_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_9_Col_1_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTtmeTxt', '[#Str_TimeLabels_Tooltips_[#Language]]')"]
    DynamicVariables=1


    [Row_9_Col_3_Text]  ;Текущее время ~ (Current Time)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row9_TextY#
    Text=[#Str_CurrentTime_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1


    [Row_9_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_8_Col_2_Rectangle:Y]+[Row_8_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorCurrTime# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_9_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_9_Col_3_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_CurrentTime_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_9_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_9_Col_3_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorCurrTime', '[#Str_CurrentTime_Tooltips_[#Language]]')"]
    DynamicVariables=1


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 9_1    | Разделительная линия                      ~ (Row 9_1 | Divider line)

    [Row_9_1]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_9_Col_2_Rectangle:Y]+[Row_9_Col_2_Rectangle:H]+(#BlockMargin#*2))
    ; Y=200
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),1,0 | Fill Color #ColorLineH1# | StrokeWidth 0 | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=0

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 10*    | Разделитель 1      | Разделитель 2        ~ (Row 10 | Separator 1  | Separator 2) 

    [CalcRow10_TextY]  ; Вычисл Row9_TextY координата центра текста для центрирования ~ (Calc Row9_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_10_Col_2_Rectangle:Y] + ([Row_10_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row10_TextY "[CalcRow10_TextY]"] 
    UpdateDivider=-1

    [Row_10_Col_1_Text]  ;Разделитель 1 ~ (Separator 1)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row10_TextY#
    Text=[#Str_Separator1_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1


    [Row_10_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_9_Col_2_Rectangle:Y]+[Row_9_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorSeparator_1# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_10_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_10_Col_1_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Separator1_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_10_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_10_Col_1_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorSeparator_1', '[#Str_Separator1_Tooltips_[#Language]]')"]
    DynamicVariables=1


    [Row_10_Col_3_Text]  ;Разделитель 2 ~ (Separator 2)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row10_TextY#
    Text=[#Str_Separator2_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1


    [Row_10_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_9_Col_2_Rectangle:Y]+[Row_9_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorSeparator_2# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_10_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_10_Col_3_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_Separator2_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_10_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_10_Col_3_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorSeparator_2', '[#Str_Separator2_Tooltips_[#Language]]')"]
    DynamicVariables=1


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 11     | Зона времени 1     | Зона времени 2       ~ (Row 11 | Time zone 1  | Time zone 2) 

    [CalcRow11_TextY]  ; Вычисл Row10_TextY координата центра текста для центрирования ~ (Calc Row10_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_11_Col_2_Rectangle:Y] + ([Row_11_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row11_TextY "[CalcRow11_TextY]"] 
    UpdateDivider=-1

    [Row_11_Col_1_Text]  ;Зона времени 1 ~ (Time zone 1)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row11_TextY#
    Text=[#Str_TimeZone1_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1


    [Row_11_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_10_Col_2_Rectangle:Y]+[Row_10_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTimeZone_1# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_11_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_11_Col_1_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_TimeZone1_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_11_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_11_Col_1_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTimeZone_1', '[#Str_TimeZone1_Tooltips_[#Language]]')"]
    DynamicVariables=1


    [Row_11_Col_3_Text]  ;Зона времени 2 ~ (Time zone 2)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row11_TextY#
    Text=[#Str_TimeZone2_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1


    [Row_11_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_10_Col_2_Rectangle:Y]+[Row_10_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTimeZone_2# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_11_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_11_Col_3_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_TimeZone2_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_11_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_11_Col_3_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTimeZone_2', '[#Str_TimeZone2_Tooltips_[#Language]]')"]
    DynamicVariables=1


;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 12     | Зона времени 3     | Основной фон         ~ (Row 12 | Time zone 3  | BG) 

    [CalcRow12_TextY]  ; Вычисл Row11_TextY координата центра текста для центрирования ~ (Calc Row11_TextY center coord for centering text)
    Measure=Calc
    Formula=([Row_12_Col_2_Rectangle:Y] + ([Row_12_Col_2_Rectangle:H]/2))
    DynamicVariables=1
    OnUpdateAction=[!SetVariable Row12_TextY "[CalcRow12_TextY]"] 
    UpdateDivider=-1

    [Row_12_Col_1_Text]  ;Зона времени 3 ~ (Time zone 3)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#PaddingL#
    Y=#Row12_TextY#
    Text=[#Str_TimeZone3_[#Language]]
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1



    [Row_12_Col_2_Rectangle]  
    Meter=Shape
    X=#Col2_X#
    Y=([Row_11_Col_2_Rectangle:Y]+[Row_11_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorTimeZone_3# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_12_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_12_Col_1_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_TimeZone3_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_12_Col_2_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_12_Col_1_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorTimeZone_3', '[#Str_TimeZone3_Tooltips_[#Language]]')"]
    ; TestError() Тестовая функция для проверки ошибки (Test function to check error handling)
    ; ВРЕМЕННАЯ! Удалить или закоментировать после тестирования! (TEMPORARY! Remove or coment after testing!)
    ; LeftMouseUpAction=[!CommandMeasure ThemeReset_Script "TestError()"]
    DynamicVariables=1



    [Row_12_Col_3_Text]  ;Основной фон ~ (BG)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    X=#Col3_X#
    Y=#Row12_TextY#
    Text=[#Str_GridBackground_[#Language]]
    StringAlign=LeftCenter
    ; Padding=5,0,5,0
    DynamicVariables=1


    [Row_12_Col_4_Rectangle]  
    Meter=Shape
    X=#Col4_X#
    Y=([Row_11_Col_2_Rectangle:Y]+[Row_11_Col_2_Rectangle:H]+(#BlockMargin#*1))
    W=0
    Shape=Rectangle 0,0,#Rectangle1_W#,#RectangleH2#,#BordrRad# | Fill Color #ColorBg# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    MouseOverAction=[!SetOption Row_12_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStrokeHover#"][!SetOption Row_12_Col_3_Text FontWeight 600][!SetOption Tooltips_Text Text "[#Str_GridBackground_Tooltips_[#Language]]"][!ShowMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    MouseLeaveAction=[!SetOption Row_12_Col_4_Rectangle StrokeMod "Stroke Color #ColorBGStroke#"][!SetOption Row_12_Col_3_Text FontWeight 300][!HideMeterGroup ColorSettingsPanelTooltips][!UpdateMeter *][!Redraw]
    leftMouseUpAction=[!CommandMeasure "ColorSelector_Start_Script" "StartWith('ColorBg', '[#Str_GridBackground_Tooltips_[#Language]]')"]
    DynamicVariables=1



;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 12_1   | Разделительная линия                      ~ (Row 12_1 | Divider line)

    [Row_12_1]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_12_Col_1_Text:Y]+[Row_12_Col_1_Text:H]+(#BlockMargin#*2))
    ; Y=200
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),1,0 | Fill Color #ColorLineH1# | StrokeWidth 0 | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=1
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 13     | Подсказки                                 ~ (Row 13 | Tooltips)

    [Row_13_Col_2_Rectangle]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_12_Col_2_Rectangle:Y]+[Row_12_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),(#RectangleH2#*1.4),#BordrRad# | Fill Color #ColorTimeZone_3# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=1
    Group=ColorSettingsPanelTooltips


    [Tooltips_Text]  ;Подсказки ~ (Tooltips)-------------------------------
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    FontWeight=600
    X=(#PaddingL#+[Row_13_Col_2_Rectangle:W]/2)
    Y=([Row_13_Col_2_Rectangle:Y] + ([Row_13_Col_2_Rectangle:H]/2))
    ; Text=[#Str_TimeZone3_[#Language]]
    Text=Подсказки
    StringAlign=CenterCenter
    Padding=5,0,5,0
    DynamicVariables=1
    Hidden=1
    Group=ColorSettingsPanelTooltips

    
;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
; Строка 13А     | Подсказки СЕРВИС                         ~ (Row 13 | Tooltips SERVIS)

    [ServTooltips_Rectangle]  
    Meter=Shape
    X=#PaddingL#
    Y=([Row_12_Col_2_Rectangle:Y]+[Row_12_Col_2_Rectangle:H]+(#BlockMargin#*4))
    W=0
    Shape=Rectangle 0,0,(#ColorSettingsPanel_W#-(#PaddingL#*2)),(#RectangleH2#*1.4),#BordrRad# | Fill Color #ServisRectBG# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=#ServisHiddenSuccess#
    Group=ColorSettingsPanelTooltips1

    [ServTooltips_Text_Success]  ;СЕРВИС текст Подсказки ~ (SERVICE text Tooltips)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    FontWeight=600
    FontSize=9
    ; X=(#PaddingL#+[ServTooltips_Rectangle:W]/2)
    X=#PaddingL#
    Y=([ServTooltips_Rectangle:Y] + ([ServTooltips_Rectangle:H]/2))
    Text=[#Str_ResetThemeSuccess_[#Language]]
    ; StringAlign=CenterCenter
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    Hidden=#ServisHiddenSuccess#
    Group=ColorSettingsPanelTooltips1

    [ServTooltips_Text_Err]  ;СЕРВИС текст Подсказки ~ (SERVICE text Tooltips)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    FontWeight=600
    FontSize=9
    ; X=(#PaddingL#+[ServTooltips_Rectangle:W]/2)
    X=(#PaddingL#+10)
    Y=([ServTooltips_Rectangle:Y] + ([ServTooltips_Rectangle:H]/2))
    Text=[#Str_ResetThemeError_[#Language]]
    ; StringAlign=CenterCenter
    StringAlign=LeftCenter
    Padding=5,0,5,0
    DynamicVariables=1
    Hidden=#ServisHiddenErr#
    Group=ColorSettingsPanelTooltips1


    [ServTooltips_RectangleOk]  ; СЕРВИС кнопка ОК ~ (SERVICE button OK)-------------------------------
    Meter=Shape
    X=([ServTooltips_Rectangle:X] + [ServTooltips_Rectangle:W]-50)
    Y=([ServTooltips_Rectangle:Y]+4)
    Shape=Rectangle 0,0,40,(#RectangleH2#*1),#BordrRad# | Fill Color #ColorTimeZone_3# | StrokeWidth #RectStrokeWidth# | Extend StrokeMod
    StrokeMod=Stroke Color #ColorBGStroke#
    DynamicVariables=1
    Hidden=#ServisHidden#
    Group=ColorSettingsPanelTooltips1

    [Tooltips_Text_Ok]  ; СЕРВИС текст КНОПКА ОК ~ (SERVICE text BUTTON OK)
    Meter=String
    MeterStyle=SettingsPanel_StyleText
    FontWeight=600
    FontSize=9
    X=([ServTooltips_RectangleOk:X]+([ServTooltips_RectangleOk:W]/2))
    Y=([ServTooltips_RectangleOk:Y] + ([ServTooltips_RectangleOk:H]/2))
    Text=Ok
    StringAlign=CenterCenter
    Padding=5,0,5,0
    DynamicVariables=1
    Hidden=#ServisHidden#
    LeftMouseUpAction=[!CommandMeasure ThemeReset_Script "HideNotification()"]
    Group=ColorSettingsPanelTooltips1

;▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆▆
    
  